{"id":"2763","level":"z1","title":"The Zoo of Extinct Animals","subtle":"Science Fiction (fiction), 2,738 words, Level Z1 (Grade 5+), Lexile 860L            \n                        \n\t\tMultilevel Book also available in levels                     Z and Z2\t\t                 \n\t\tMultilevel Book also available in level                     Z2","description":"The Buckland Rare Animal Research Center seems to be the perfect fit for Hazel's summer internship. Once she arrives, however, Hazel quickly realizes this is not an ordinary zoo. In fact, the research center has been bringing extinct animals back to life, but at what cost? The Zoo of Extinct Animals presents students with a plotline that challenges both the protagonist and the readers to answer some difficult moral questions. The book can also be used to teach students how to analyze plot for unusual story structures and the proper use of comparative and superlative adjectives. The book and lesson are also available for levels Z and Z2.","count":26,"from":0,"meta":["captive breeding, compound, conservation, conspiracy theorist, coy, extinct, genetic, high ground, humane, internship, media, monitor, nocturnal, perpetuity, protest, ramifications, reaches, reproductive, resident, specimens, speculated, strained, transport, violating","Make, revise, and confirm predictions","Analyze Plot : Analyze elements of plot","Comparative and Superlative Adjectives : Recognize and use comparative and superlative adjectives","Content Vocabulary : Identify and use content vocabulary words","Promote higher-order thinking for small groups <br>or whole class"],"pdfs":["pdfsite\/2763\/raz_lz12_zooofextinctanimals_wksh.pdf","pdfsite\/2763\/raz_lz12_zooofextinctanimals_wksh_rc.pdf","pdfsite\/2763\/raz_lz12_zooofextinctanimals_wksh_gm.pdf","pdfsite\/2763\/raz_lz12_zooofextinctanimals_wksh_ww.pdf","pdfsite\/discussion\/z1\/raz_dclz12_zooofextinctanimals.pdf","pdfsite\/comp_quiz\/z1\/raz_cqlz12_zooofextinctanimals.pdf"],"mis":{"clr":"pdfs\/levels\/z1\/raz_lz12_zooofextinctanimals_clr_ds.pdf","lblp":"pdfsite\/2763\/raz_lz12_zooofextinctanimals_lblp.pdf"}}