{"id":"3907","level":"z","title":"The Birmingham Children's Crusade","subtle":"Informational (nonfiction), 1,750 words, Level Z (Grade 5), Lexile 940L","description":"Growing up as an African American child in Birmingham, Alabama, during the early half of the twentieth century was an incredibly dangerous time. Segregation was still prevalent, and the treatment of African Americans was horrific. Children watched as their elders faced discrimination and hate daily, until they too decided to take a stand. <em>The Birmingham Children's Crusade<\/em> tells of how African American children bravely protested by peacefully marching the streets of Birmingham. Historical photographs document the struggle African Americans faced during this time. This protest combined with Dr. Martin Luther King Jr.'s presence gained the attention of the world and played a significant role in the civil rights movement. This book can be used to teach students how to sequence events, describe information from photographs, and identify proper nouns as well as prefixes.","count":18,"from":0,"meta":["activists, confrontations, controversial, demonstrations, discrimination, disrupt, momentum, negotiate, nonviolent direct action, racism, segregation, urgency","Connect to prior knowledge","Sequence Events : Sequence events in text","Pronouns : Recognize and use pronouns","Prefixes : Identify the prefix <i>dis-<\/i>","Promote higher-order thinking for small groups <br>or whole class"],"pdfs":["pdfsite\/3907\/raz_lz35_birminghamchildrenscrusade_wksh.pdf","pdfsite\/3907\/raz_lz35_birminghamchildrenscrusade_wksh_rc.pdf","pdfsite\/3907\/raz_lz35_birminghamchildrenscrusade_wksh_gm.pdf","pdfsite\/3907\/raz_lz35_birminghamchildrenscrusade_wksh_ww.pdf","pdfsite\/discussion\/z\/raz_dclz35_birminghamchildrenscrusade.pdf","pdfsite\/comp_quiz\/z\/raz_cqlz35_birminghamchildrenscrusade.pdf"],"mis":{"clr":"pdfsite\/levels\/z_ds\/raz_lz35_birminghamchildrenscrusade_clr_ds.pdf","lblp":"pdfsite\/3907\/raz_lz35_birminghamchildrenscrusade_lblp.pdf"}}