{"id":"823","level":"z","title":"The Black Stones","subtle":"Realistic (fiction), 2,299 words, Level Z (Grade 5), Lexile 900L            \n                        \n\t\tMultilevel Book also available in levels                     T and W\t\t                 \n\t\tMultilevel Book also available in levels                     T and W","description":"The Black Stones tells the story of eleven-year-old twins who learn how to put aside their differences and get along with each other. Tala finds two obsidian stones and wants to learn more about how they were formed from a scientific viewpoint. Her brother Paco isn't interested in science and wants to find out if the stones are lucky charms or have magical properties. Their mother forces them to work together to find the answers. The twins are surprised to find out that they like working together. Illustrations support the text.","count":25,"from":1,"meta":["Apache, bicker, chasm, confront, frenzied, hypotheses, intrigued, obsidian, outrageous, perspectives, pestering, pilgrimage, preoccupied, quarreling, scouring, scurried, sibling, subconscious, talisman, theories, tolerate, translucent, unison","Use the reading strategy of visualizing to understand text","Compare and Contrast : Compare and contrast characters","Adverbs : Identify and understand the use of adverbs","Figurative Language : Identify and understand the use of three types of figurative language","Promote higher-order thinking for small groups <br>or whole class"],"pdfs":["pdfsite\/nonbooks\/readers_theater_script\/the_black_stones.pdf","pdfsite\/worksheets\/z\/raz_lz33_blackstones_wksh.pdf","pdfsite\/worksheets\/z\/raz_lz33_blackstones_wksh_rs.pdf","pdfsite\/worksheets\/z\/raz_lz33_blackstones_wksh_rc.pdf","pdfsite\/worksheets\/z\/raz_lz33_blackstones_wksh_gm.pdf","pdfsite\/discussion\/z\/raz_dclz33_blackstones.pdf","pdfsite\/comp_quiz\/z\/raz_cqlz33_blackstones.pdf"],"mis":{"clr":"pdfsite\/levels\/z_ds\/raz_lz33_blackstones_clr_ds.pdf","lblp":"pdfsite\/lesson_plans\/z\/raz_lz13_theblackstones_lp.pdf"}}